app/controllers/datasets_controller.rb

  def index
    @datasets = Dataset.all
---
SELECT * FROM "datasets"

  def show
    @dataset = Dataset.find(params[:id])
---
SELECT * FROM "datasets" WHERE ("datasets"."id" = 2)

  def create
    @dataset = Dataset.new(params[:dataset])

    respond_to do |format|
      if @dataset.save
---
INSERT INTO "datasets" ("created_at", "updated_at", "uid") VALUES('2010-06-28 03:36:43', '2010-06-28 03:36:43', 'foobar')

  def update
    @dataset = Dataset.find(params[:id])
    @dataset.database_table.remove_data(params[:remove_rows], params[:remove_cols]
                        ) unless params[:remove_rows].blank? #it's ok if removecols is blank
    @dataset.database_table.add_data(params[:data_url]) unless params[:data_url].blank?
    if not params[:service].blank?
      if Dataset.supports_service?(params[:service])
        @dataset.learn(params[:service].intern)
      else
        head :unprocessable_entity and return
      end
    end

    respond_to do |format|
      if @dataset.update_attributes(params[:dataset])
---
SELECT * FROM "datasets" WHERE ("datasets"."id" = 12)
SELECT "datasets".id FROM "datasets" WHERE ("datasets"."uid" = 'tom' AND "datasets".id <> 12) LIMIT 1
UPDATE "datasets" SET "updated_at" = '2010-06-28 05:04:25', "uid" = 'tom' WHERE "id" = 12

  def destroy
    @dataset = Dataset.find(params[:id])
    @dataset.destroy
---
SELECT * FROM "datasets" WHERE ("datasets"."id" = 1)
DELETE FROM "datasets" WHERE "id" = 1